graphcoloring.org
#+TITLE:    Graph Coloring Benchmark Instances
#+OPTIONS: ^:nil html-postamble:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../Pub/solarized-light.css" />


* Utils
- [[./instances/converter.tar.gz][Converter]]: convert from benchmarks from ~ascii~ to ~binary~ format and vice versa.
- [[./instances/benchmark.tar.gz][Benchmark]]: 
	Since the experiments are performed on different machines,
	download this file, untar, compile the program ~dfmax~, 
	run the program on ~r500.b~, and report the resulting computation time.

