graphcoloring.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Graph Coloring Benchmark Instances</title>
<!-- 2017-01-01 Sun 22:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="tnguyen@GiaoChi" />
<link rel="stylesheet" type="text/css" href="../Pub/solarized-light.css" />
</head>
<body>
<div id="content">
<h1 class="title">Graph Coloring Benchmark Instances</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Utils</a></li>
<li><a href="#sec-2">2. Graph Coloring instances</a></li>
<li><a href="#sec-3">3. Coloring with Fixed Set instances</a></li>
<li><a href="#sec-4">4. Bandwidth and Multicoloring instances</a></li>
<li><a href="#sec-5">5. Categories</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Utils</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="./instances/converter.tar.gz">Converter</a>: convert from benchmarks from <code>ascii</code> to <code>binary</code> format and vice versa.
</li>
<li><a href="./instances/benchmark.tar.gz">Benchmark</a>: 
Since the experiments are performed on different machines,
download this file, untar, compile the program <code>dfmax</code>, 
run the program on <code>r500.b</code>, and report the resulting computation time.
</li>
</ul>
</div>
</div>
