graphcoloring.org
* Graph Coloring instances 
  [[./instances/coloring/graph_color/][Directory]], 
  [[./instances/coloring/graph_color.tar.gz][tar.gz format]]

#+NAME: tab:gc
|     | File                                                                             | Vertices |  Edges | Sol | Category | Note                                                  |
|-----+----------------------------------------------------------------------------------+----------+--------+-----+----------+-------------------------------------------------------|
|   1 | [[./instances/coloring/graph_color/DSJC125.1.col][(*)DSJC125.1.col]]             |      125 |    736 |   ? | DSJ      |                                                       |
|   2 | [[./instances/coloring/graph_color/DSJC125.5.col][(*)DSJC125.5.col]]             |      125 |   3891 |   ? | DSJ      |                                                       |
|   3 | [[./instances/coloring/graph_color/DSJC125.9.col][(*)DSJC125.9.col]]             |      125 |   6961 |   ? | DSJ      |                                                       |
|   4 | [[./instances/coloring/graph_color/DSJC250.1.col][(*)DSJC250.1.col]]             |      250 |   3218 |   ? | DSJ      |                                                       |
|   5 | [[./instances/coloring/graph_color/DSJC250.5.col][(*)DSJC250.5.col]]             |      250 |  15668 |   ? | DSJ      |                                                       |
|   6 | [[./instances/coloring/graph_color/DSJC250.9.col][(*)DSJC250.9.col]]             |      250 |  27897 |   ? | DSJ      |                                                       |
|   7 | [[./instances/coloring/graph_color/DSJC500.1.col][(*)DSJC500.1.col]]             |      500 |  12458 |   ? | DSJ      |                                                       |
|   8 | [[./instances/coloring/graph_color/DSJC500.5.col][(*)DSJC500.5.col]]             |      500 |  62624 |   ? | DSJ      |                                                       |
|   9 | [[./instances/coloring/graph_color/DSJC500.9.col][(*)DSJC500.9.col]]             |      500 | 224874 |   ? | DSJ      | # edges should be[fn:1] 112437                        |
|  10 | [[./instances/coloring/graph_color/DSJR500.1.col][(*)DSJR500.1.col]]             |      500 |   3555 |   ? | DSJ      |                                                       |
|  11 | [[./instances/coloring/graph_color/DSJR500.1c.col][(*)DSJR500.1c.col]]           |      500 | 121275 |   ? | DSJ      |                                                       |
|  12 | [[./instances/coloring/graph_color/DSJR500.5.col][(*)DSJR500.5.col]]             |      500 |  58862 |   ? | DSJ      |                                                       |
|  13 | [[./instances/coloring/graph_color/DSJC1000.1.col][(*)DSJC1000.1.col]]           |     1000 |  49629 |   ? | DSJ      |                                                       |
|  14 | [[./instances/coloring/graph_color/DSJC1000.5.col][(*)DSJC1000.5.col]]           |     1000 | 249826 |   ? | DSJ      |                                                       |
|  15 | [[./instances/coloring/graph_color/DSJC1000.9.col][(*)DSJC1000.9.col]]           |     1000 | 449449 |   ? | DSJ      |                                                       |
|  16 | [[./instances/coloring/graph_color/fpsol2.i.1.col][fpsol2.i.1.col]]              |      496 |  11654 |  65 | REG      |                                                       |
|  17 | [[./instances/coloring/graph_color/fpsol2.i.2.col][fpsol2.i.2.col]]              |      451 |   8691 |  30 | REG      |                                                       |
|  18 | [[./instances/coloring/graph_color/fpsol2.i.3.col][fpsol2.i.3.col]]              |      425 |   8688 |  30 | REG      |                                                       |
|  19 | [[./instances/coloring/graph_color/inithx.i.1.col][inithx.i.1.col]]              |      864 |  18707 |  54 | REG      |                                                       |
|  20 | [[./instances/coloring/graph_color/inithx.i.2.col][inithx.i.2.col]]              |      645 |  13979 |  31 | REG      |                                                       |
|  21 | [[./instances/coloring/graph_color/inithx.i.3.col][inithx.i.3.col]]              |      621 |  13969 |  31 | REG      |                                                       |
|  22 | [[./instances/coloring/graph_color/latin_square_10.col][(*)latin_square_10.col]] |      900 | 307350 |   ? | LAT      |                                                       |
|  23 | [[./instances/coloring/graph_color/le450_15a.col][(*)le450_15a.col]]             |      450 |   8168 |  15 | LEI      |                                                       |
|  24 | [[./instances/coloring/graph_color/le450_15b.col][(*)le450_15b.col]]             |      450 |   8169 |  15 | LEI      |                                                       |
|  25 | [[./instances/coloring/graph_color/le450_15c.col][(*)le450_15c.col]]             |      450 |  16680 |  15 | LEI      |                                                       |
|  26 | [[./instances/coloring/graph_color/le450_15d.col][(*)le450_15d.col]]             |      450 |  16750 |  15 | LEI      |                                                       |
|  27 | [[./instances/coloring/graph_color/le450_25a.col][(*)le450_25a.col]]             |      450 |   8260 |  25 | LEI      |                                                       |
|  28 | [[./instances/coloring/graph_color/le450_25b.col][(*)le450_25b.col]]             |      450 |   8263 |  25 | LEI      |                                                       |
|  29 | [[./instances/coloring/graph_color/le450_25c.col][(*)le450_25c.col]]             |      450 |  17343 |  25 | LEI      |                                                       |
|  30 | [[./instances/coloring/graph_color/le450_25d.col][(*)le450_25d.col]]             |      450 |  17425 |  25 | LEI      |                                                       |
|  31 | [[./instances/coloring/graph_color/le450_5a.col][(*)le450_5a.col]]               |      450 |   5714 |   5 | LEI      |                                                       |
|  32 | [[./instances/coloring/graph_color/le450_5b.col][(*)le450_5b.col]]               |      450 |   5734 |   5 | LEI      |                                                       |
|  33 | [[./instances/coloring/graph_color/le450_5c.col][(*)le450_5c.col]]               |      450 |   9803 |   5 | LEI      |                                                       |
|  34 | [[./instances/coloring/graph_color/le450_5d.col][(*)le450_5d.col]]               |      450 |   9757 |   5 | LEI      |                                                       |
|  35 | [[./instances/coloring/graph_color/mulsol.i.1.col][mulsol.i.1.col]]              |      197 |   3925 |  49 | REG      |                                                       |
|  36 | [[./instances/coloring/graph_color/mulsol.i.2.col][mulsol.i.2.col]]              |      188 |   3885 |  31 | REG      |                                                       |
|  37 | [[./instances/coloring/graph_color/mulsol.i.3.col][mulsol.i.3.col]]              |      184 |   3916 |  31 | REG      |                                                       |
|  38 | [[./instances/coloring/graph_color/mulsol.i.4.col][mulsol.i.4.col]]              |      185 |   3946 |  31 | REG      |                                                       |
|  39 | [[./instances/coloring/graph_color/mulsol.i.5.col][mulsol.i.5.col]]              |      186 |   3973 |  31 | REG      |                                                       |
|  40 | [[./instances/coloring/graph_color/school1.col][school1.col]]                    |      385 |  19095 |   ? | SCH      |                                                       |
|  41 | [[./instances/coloring/graph_color/school1_nsh.col][(*)school1_nsh.col]]         |      352 |  14612 |   ? | SCH      |                                                       |
|  42 | [[./instances/coloring/graph_color/zeroin.i.1.col][zeroin.i.1.col]]              |      211 |   4100 |  49 | REG      |                                                       |
|  43 | [[./instances/coloring/graph_color/zeroin.i.2.col][zeroin.i.2.col]]              |      211 |   3541 |  30 | REG      |                                                       |
|  44 | [[./instances/coloring/graph_color/zeroin.i.3.col][zeroin.i.3.col]]              |      206 |   3540 |  30 | REG      |                                                       |
|  45 | [[./instances/coloring/graph_color/anna.col][anna.col]]                          |      138 |    493 |  11 | SGB      |                                                       |
|  46 | [[./instances/coloring/graph_color/david.col][david.col]]                        |       87 |    406 |  11 | SGB      |                                                       |
|  47 | [[./instances/coloring/graph_color/homer.col][homer.col]]                        |      561 |   1629 |  13 | SGB      | # edges should be[fn:1] 1628 + 1 self-loop edge[fn:2] |
|  48 | [[./instances/coloring/graph_color/huck.col][huck.col]]                          |       74 |    301 |  11 | SGB      |                                                       |
|  49 | [[./instances/coloring/graph_color/jean.col][jean.col]]                          |       80 |    254 |  10 | SGB      |                                                       |
|  50 | [[./instances/coloring/graph_color/games120.col][games120.col]]                  |      120 |    638 |   9 | SGB      |                                                       |
|  51 | [[./instances/coloring/graph_color/miles1000.col][miles1000.col]]                |      128 |   3216 |  42 | SGB      |                                                       |
|  52 | [[./instances/coloring/graph_color/miles1500.col][miles1500.col]]                |      128 |   5198 |  73 | SGB      |                                                       |
|  53 | [[./instances/coloring/graph_color/miles250.col][miles250.col]]                  |      128 |    387 |   8 | SGB      |                                                       |
|  54 | [[./instances/coloring/graph_color/miles500.col][miles500.col]]                  |      128 |   1170 |  20 | SGB      |                                                       |
|  55 | [[./instances/coloring/graph_color/miles750.col][miles750.col]]                  |      128 |   2113 |  31 | SGB      |                                                       |
|  56 | [[./instances/coloring/graph_color/queen5_5.col][queen5_5.col]]                  |       25 |    160 |   5 | SGB      |                                                       |
|  57 | [[./instances/coloring/graph_color/queen6_6.col][queen6_6.col]]                  |       36 |    290 |   7 | SGB      |                                                       |
|  58 | [[./instances/coloring/graph_color/queen7_7.col][queen7_7.col]]                  |       49 |    476 |   7 | SGB      |                                                       |
|  59 | [[./instances/coloring/graph_color/queen8_12.col][(*)queen8_12.col]]             |       96 |   1368 |  12 | SGB      |                                                       |
|  60 | [[./instances/coloring/graph_color/queen8_8.col][(*)queen8_8.col]]               |       64 |    728 |   9 | SGB      |                                                       |
|  61 | [[./instances/coloring/graph_color/queen9_9.col][(*)queen9_9.col]]               |       81 |   2112 |  10 | SGB      | # edges should be[fn:1] 1056                          |
|  62 | [[./instances/coloring/graph_color/queen10_10.col][(*)queen10_10.col]]           |      100 |   2940 |   ? | SGB      | # edges should be[fn:1] 1470                          |
|  63 | [[./instances/coloring/graph_color/queen11_11.col][(*)queen11_11.col]]           |      121 |   3960 |  11 | SGB      | # edges should be[fn:1] 1980                          |
|  64 | [[./instances/coloring/graph_color/queen12_12.col][(*)queen12_12.col]]           |      144 |   5192 |   ? | SGB      | # edges should be[fn:1] 2596                          |
|  65 | [[./instances/coloring/graph_color/queen13_13.col][(*)queen13_13.col]]           |      169 |   6656 |  13 | SGB      | # edges should be[fn:1] 3328                          |
|  66 | [[./instances/coloring/graph_color/queen14_14.col][(*)queen14_14.col]]           |      196 |   8372 |   ? | SGB      | # edges should be[fn:1] 4186                          |
|  67 | [[./instances/coloring/graph_color/queen15_15.col][(*)queen15_15.col]]           |      225 |  10360 |   ? | SGB      | # edges should be[fn:1] 5180                          |
|  68 | [[./instances/coloring/graph_color/queen16_16.col][(*)queen16_16.col]]           |      256 |  12640 |   ? | SGB      | # edges should be[fn:1] 6320                          |
|  69 | [[./instances/coloring/graph_color/myciel3.col][myciel3.col]]                    |       11 |     20 |   4 | MYC      |                                                       |
|  70 | [[./instances/coloring/graph_color/myciel4.col][myciel4.col]]                    |       23 |     71 |   5 | MYC      |                                                       |
|  71 | [[./instances/coloring/graph_color/myciel5.col][(*)myciel5.col]]                 |       47 |    236 |   6 | MYC      |                                                       |
|  72 | [[./instances/coloring/graph_color/myciel6.col][(*)myciel6.col]]                 |       95 |    755 |   7 | MYC      |                                                       |
|  73 | [[./instances/coloring/graph_color/myciel7.col][(*)myciel7.col]]                 |      191 |   2360 |   8 | MYC      |                                                       |
|  74 | [[./instances/coloring/graph_color/mug88_1.col][mugg88_1.col]]                   |       88 |    146 |   4 | MIZ      |                                                       |
|  75 | [[./instances/coloring/graph_color/mug88_25.col][mugg88_25.col]]                 |       88 |    146 |   4 | MIZ      |                                                       |
|  76 | [[./instances/coloring/graph_color/mug100_1.col][mugg100_1.col]]                 |      100 |    166 |   4 | MIZ      |                                                       |
|  77 | [[./instances/coloring/graph_color/mug100_25.col][(*)mugg100_25.col]]            |      100 |    166 |   4 | MIZ      |                                                       |
|  78 | [[./instances/coloring/graph_color/abb313GPIA.col][abb313GPIA.col]]              |     1557 |  53356 |   ? | HOS      | corrected 12/29/03                                    |
|  79 | [[./instances/coloring/graph_color/ash331GPIA.col][ash331GPIA.col]]              |      662 |   4185 |   ? | HOS      |                                                       |
|  80 | [[./instances/coloring/graph_color/ash608GPIA.col][ash608GPIA.col]]              |     1216 |   7844 |   ? | HOS      |                                                       |
|  81 | [[./instances/coloring/graph_color/ash958GPIA.col][ash958GPIA.col]]              |     1916 |  12506 |   ? | HOS      |                                                       |
|  82 | [[./instances/coloring/graph_color/will199GPIA.col][will199GPIA.col]]            |      701 |   6772 |   ? | HOS      | corrected 12/29/03                                    |
|  83 | [[./instances/coloring/graph_color/1-Insertions_4.col][(*)1-Insertions_4.col]]   |       67 |    232 |   4 | CAR      |                                                       |
|  84 | [[./instances/coloring/graph_color/1-Insertions_5.col][(*)1-Insertions_5.col]]   |      202 |   1227 |   ? | CAR      |                                                       |
|  85 | [[./instances/coloring/graph_color/1-Insertions_6.col][(*)1-Insertions_6.col]]   |      607 |   6337 |   ? | CAR      |                                                       |
|  86 | [[./instances/coloring/graph_color/2-Insertions_3.col][(*)2-Insertions_3.col]]   |       37 |     72 |   4 | CAR      |                                                       |
|  87 | [[./instances/coloring/graph_color/2-Insertions_4.col][(*)2-Insertions_4.col]]   |      149 |    541 |   4 | CAR      |                                                       |
|  88 | [[./instances/coloring/graph_color/2-Insertions_5.col][(*)2-Insertions_5.col]]   |      597 |   3936 |   ? | CAR      |                                                       |
|  89 | [[./instances/coloring/graph_color/3-Insertions_3.col][(*)3-Insertions_3.col]]   |       56 |    110 |   4 | CAR      |                                                       |
|  90 | [[./instances/coloring/graph_color/3-Insertions_4.col][(*)3-Insertions_4.col]]   |      281 |   1046 |   ? | CAR      |                                                       |
|  91 | [[./instances/coloring/graph_color/3-Insertions_5.col][(*)3-Insertions_5.col]]   |     1406 |   9695 |   ? | CAR      |                                                       |
|  92 | [[./instances/coloring/graph_color/4-Insertions_3.col][(*)4-Insertions_3.col]]   |       79 |    156 |   3 | CAR      |                                                       |
|  93 | [[./instances/coloring/graph_color/4-Insertions_4.col][(*)4-Insertions_4.col]]   |      475 |   1795 |   ? | CAR      |                                                       |
|  94 | [[./instances/coloring/graph_color/1-FullIns_3.col][(*)1-FullIns_3.col]]         |       30 |    100 |   ? | CAR      |                                                       |
|  95 | [[./instances/coloring/graph_color/1-FullIns_4.col][(*)1-FullIns_4.col]]         |       93 |    593 |   ? | CAR      |                                                       |
|  96 | [[./instances/coloring/graph_color/1-FullIns_5.col][(*)1-FullIns_5.col]]         |      282 |   3247 |   ? | CAR      |                                                       |
|  97 | [[./instances/coloring/graph_color/2-FullIns_3.col][(*)2-FullIns_3.col]]         |       52 |    201 |   ? | CAR      |                                                       |
|  98 | [[./instances/coloring/graph_color/2-FullIns_4.col][(*)2-FullIns_4.col]]         |      212 |   1621 |   ? | CAR      |                                                       |
|  99 | [[./instances/coloring/graph_color/2-FullIns_5.col][(*)2-FullIns_5.col]]         |      852 |  12201 |   ? | CAR      |                                                       |
| 100 | [[./instances/coloring/graph_color/3-FullIns_3.col][(*)3-FullIns_3.col]]         |       80 |    346 |   ? | CAR      |                                                       |
| 101 | [[./instances/coloring/graph_color/3-FullIns_4.col][(*)3-FullIns_4.col]]         |      405 |   3524 |   ? | CAR      |                                                       |
| 102 | [[./instances/coloring/graph_color/3-FullIns_5.col][(*)3-FullIns_5.col]]         |     2030 |  33751 |   ? | CAR      |                                                       |
| 103 | [[./instances/coloring/graph_color/4-FullIns_3.col][(*)4-FullIns_3.col]]         |      114 |    541 |   ? | CAR      |                                                       |
| 104 | [[./instances/coloring/graph_color/4-FullIns_4.col][(*)4-FullIns_4.col]]         |      690 |   6650 |   ? | CAR      |                                                       |
| 105 | [[./instances/coloring/graph_color/4-FullIns_5.col][(*)4-FullIns_5.col]]         |     4146 |  77305 |   ? | CAR      |                                                       |
| 106 | [[./instances/coloring/graph_color/5-FullIns_3.col][(*)5-FullIns_3.col]]         |      154 |    792 |   ? | CAR      |                                                       |
| 107 | [[./instances/coloring/graph_color/5-FullIns_4.col][(*)5-FullIns_4.col]]         |     1085 |  11395 |   ? | CAR      |                                                       |
| 108 | [[./instances/coloring/graph_color/wap01a.col][wap01a.col]]                      |     2368 | 110871 |   ? | KOS      |                                                       |
| 109 | [[./instances/coloring/graph_color/wap02a.col][wap02a.col]]                      |     2464 | 111742 |   ? | KOS      |                                                       |
| 110 | [[./instances/coloring/graph_color/wap03a.col][wap03a.col]]                      |     4730 | 286722 |   ? | KOS      |                                                       |
| 111 | [[./instances/coloring/graph_color/wap04a.col][wap04a.col]]                      |     5231 | 294902 |   ? | KOS      | # vertices \gt 5000                                   |
| 112 | [[./instances/coloring/graph_color/wap05a.col][wap05a.col]]                      |      905 |  43081 |   ? | KOS      |                                                       |
| 113 | [[./instances/coloring/graph_color/wap06a.col][wap06a.col]]                      |      947 |  43571 |   ? | KOS      |                                                       |
| 114 | [[./instances/coloring/graph_color/wap07a.col][wap07a.col]]                      |     1809 | 103368 |   ? | KOS      |                                                       |
| 115 | [[./instances/coloring/graph_color/wap08a.col][wap08a.col]]                      |     1870 | 104176 |   ? | KOS      |                                                       |
| 116 | [[./instances/coloring/graph_color/qg.order30.col][qg.order30.col]]              |      900 |  26100 |  30 | GOM      |                                                       |
| 117 | [[./instances/coloring/graph_color/qg.order40.col][qg.order40.col]]              |     1600 |  62400 |  40 | GOM      |                                                       |
| 118 | [[./instances/coloring/graph_color/qg.order60.col][qg.order60.col]]              |     3600 | 212400 |  60 | GOM      |                                                       |
| 119 | [[./instances/coloring/graph_color/qg.order100.col][qg.order100.col]]            |    10000 | 990000 | 100 | GOM      | # vertices \gt 5000                                   |
|-----+----------------------------------------------------------------------------------+----------+--------+-----+----------+-------------------------------------------------------|
#+tblfm: $1=@#-1   
# C+c C+c to reapply formula

