graphcoloring.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Graph Coloring instances</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="./instances/coloring/graph_color/">Directory</a>, 
<a href="./instances/coloring/graph_color.tar.gz">tar.gz format</a>
</p>

<table id="tab:gc" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left">File</th>
<th scope="col" class="right">Vertices</th>
<th scope="col" class="right">Edges</th>
<th scope="col" class="right">Sol</th>
<th scope="col" class="left">Category</th>
<th scope="col" class="left">Note</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left"><a href="./instances/coloring/graph_color/DSJC125.1.col">(*)DSJC125.1.col</a></td>
<td class="right">125</td>
<td class="right">736</td>
<td class="right">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left"><a href="./instances/coloring/graph_color/DSJC125.5.col">(*)DSJC125.5.col</a></td>
<td class="right">125</td>
<td class="right">3891</td>
<td class="right">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left"><a href="./instances/coloring/graph_color/DSJC125.9.col">(*)DSJC125.9.col</a></td>
<td class="right">125</td>
<td class="right">6961</td>
<td class="right">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left"><a href="./instances/coloring/graph_color/DSJC250.1.col">(*)DSJC250.1.col</a></td>
<td class="right">250</td>
<td class="right">3218</td>
<td class="right">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">5</td>
<td class="left"><a href="./instances/coloring/graph_color/DSJC250.5.col">(*)DSJC250.5.col</a></td>
<td class="right">250</td>
<td class="right">15668</td>
<td class="right">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left"><a href="./instances/coloring/graph_color/DSJC250.9.col">(*)DSJC250.9.col</a></td>
<td class="right">250</td>
<td class="right">27897</td>
<td class="right">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">7</td>
<td class="left"><a href="./instances/coloring/graph_color/DSJC500.1.col">(*)DSJC500.1.col</a></td>
<td class="right">500</td>
<td class="right">12458</td>
<td class="right">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">8</td>
<td class="left"><a href="./instances/coloring/graph_color/DSJC500.5.col">(*)DSJC500.5.col</a></td>
<td class="right">500</td>
<td class="right">62624</td>
<td class="right">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">9</td>
<td class="left"><a href="./instances/coloring/graph_color/DSJC500.9.col">(*)DSJC500.9.col</a></td>
<td class="right">500</td>
<td class="right">224874</td>
<td class="right">?</td>
<td class="left">DSJ</td>
<td class="left"># edges should be<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> 112437</td>
</tr>

<tr>
<td class="right">10</td>
<td class="left"><a href="./instances/coloring/graph_color/DSJR500.1.col">(*)DSJR500.1.col</a></td>
<td class="right">500</td>
<td class="right">3555</td>
<td class="right">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">11</td>
<td class="left"><a href="./instances/coloring/graph_color/DSJR500.1c.col">(*)DSJR500.1c.col</a></td>
<td class="right">500</td>
<td class="right">121275</td>
<td class="right">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">12</td>
<td class="left"><a href="./instances/coloring/graph_color/DSJR500.5.col">(*)DSJR500.5.col</a></td>
<td class="right">500</td>
<td class="right">58862</td>
<td class="right">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">13</td>
<td class="left"><a href="./instances/coloring/graph_color/DSJC1000.1.col">(*)DSJC1000.1.col</a></td>
<td class="right">1000</td>
<td class="right">49629</td>
<td class="right">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">14</td>
<td class="left"><a href="./instances/coloring/graph_color/DSJC1000.5.col">(*)DSJC1000.5.col</a></td>
<td class="right">1000</td>
<td class="right">249826</td>
<td class="right">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">15</td>
<td class="left"><a href="./instances/coloring/graph_color/DSJC1000.9.col">(*)DSJC1000.9.col</a></td>
<td class="right">1000</td>
<td class="right">449449</td>
<td class="right">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">16</td>
<td class="left"><a href="./instances/coloring/graph_color/fpsol2.i.1.col">fpsol2.i.1.col</a></td>
<td class="right">496</td>
<td class="right">11654</td>
<td class="right">65</td>
<td class="left">REG</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">17</td>
<td class="left"><a href="./instances/coloring/graph_color/fpsol2.i.2.col">fpsol2.i.2.col</a></td>
<td class="right">451</td>
<td class="right">8691</td>
<td class="right">30</td>
<td class="left">REG</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">18</td>
<td class="left"><a href="./instances/coloring/graph_color/fpsol2.i.3.col">fpsol2.i.3.col</a></td>
<td class="right">425</td>
<td class="right">8688</td>
<td class="right">30</td>
<td class="left">REG</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">19</td>
<td class="left"><a href="./instances/coloring/graph_color/inithx.i.1.col">inithx.i.1.col</a></td>
<td class="right">864</td>
<td class="right">18707</td>
<td class="right">54</td>
<td class="left">REG</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">20</td>
<td class="left"><a href="./instances/coloring/graph_color/inithx.i.2.col">inithx.i.2.col</a></td>
<td class="right">645</td>
<td class="right">13979</td>
<td class="right">31</td>
<td class="left">REG</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">21</td>
<td class="left"><a href="./instances/coloring/graph_color/inithx.i.3.col">inithx.i.3.col</a></td>
<td class="right">621</td>
<td class="right">13969</td>
<td class="right">31</td>
<td class="left">REG</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">22</td>
<td class="left"><a href="./instances/coloring/graph_color/latin_square_10.col">(*)latin_square_10.col</a></td>
<td class="right">900</td>
<td class="right">307350</td>
<td class="right">?</td>
<td class="left">LAT</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">23</td>
<td class="left"><a href="./instances/coloring/graph_color/le450_15a.col">(*)le450_15a.col</a></td>
<td class="right">450</td>
<td class="right">8168</td>
<td class="right">15</td>
<td class="left">LEI</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">24</td>
<td class="left"><a href="./instances/coloring/graph_color/le450_15b.col">(*)le450_15b.col</a></td>
<td class="right">450</td>
<td class="right">8169</td>
<td class="right">15</td>
<td class="left">LEI</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">25</td>
<td class="left"><a href="./instances/coloring/graph_color/le450_15c.col">(*)le450_15c.col</a></td>
<td class="right">450</td>
<td class="right">16680</td>
<td class="right">15</td>
<td class="left">LEI</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">26</td>
<td class="left"><a href="./instances/coloring/graph_color/le450_15d.col">(*)le450_15d.col</a></td>
<td class="right">450</td>
<td class="right">16750</td>
<td class="right">15</td>
<td class="left">LEI</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">27</td>
<td class="left"><a href="./instances/coloring/graph_color/le450_25a.col">(*)le450_25a.col</a></td>
<td class="right">450</td>
<td class="right">8260</td>
<td class="right">25</td>
<td class="left">LEI</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">28</td>
<td class="left"><a href="./instances/coloring/graph_color/le450_25b.col">(*)le450_25b.col</a></td>
<td class="right">450</td>
<td class="right">8263</td>
<td class="right">25</td>
<td class="left">LEI</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">29</td>
<td class="left"><a href="./instances/coloring/graph_color/le450_25c.col">(*)le450_25c.col</a></td>
<td class="right">450</td>
<td class="right">17343</td>
<td class="right">25</td>
<td class="left">LEI</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">30</td>
<td class="left"><a href="./instances/coloring/graph_color/le450_25d.col">(*)le450_25d.col</a></td>
<td class="right">450</td>
<td class="right">17425</td>
<td class="right">25</td>
<td class="left">LEI</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">31</td>
<td class="left"><a href="./instances/coloring/graph_color/le450_5a.col">(*)le450_5a.col</a></td>
<td class="right">450</td>
<td class="right">5714</td>
<td class="right">5</td>
<td class="left">LEI</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">32</td>
<td class="left"><a href="./instances/coloring/graph_color/le450_5b.col">(*)le450_5b.col</a></td>
<td class="right">450</td>
<td class="right">5734</td>
<td class="right">5</td>
<td class="left">LEI</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">33</td>
<td class="left"><a href="./instances/coloring/graph_color/le450_5c.col">(*)le450_5c.col</a></td>
<td class="right">450</td>
<td class="right">9803</td>
<td class="right">5</td>
<td class="left">LEI</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">34</td>
<td class="left"><a href="./instances/coloring/graph_color/le450_5d.col">(*)le450_5d.col</a></td>
<td class="right">450</td>
<td class="right">9757</td>
<td class="right">5</td>
<td class="left">LEI</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">35</td>
<td class="left"><a href="./instances/coloring/graph_color/mulsol.i.1.col">mulsol.i.1.col</a></td>
<td class="right">197</td>
<td class="right">3925</td>
<td class="right">49</td>
<td class="left">REG</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">36</td>
<td class="left"><a href="./instances/coloring/graph_color/mulsol.i.2.col">mulsol.i.2.col</a></td>
<td class="right">188</td>
<td class="right">3885</td>
<td class="right">31</td>
<td class="left">REG</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">37</td>
<td class="left"><a href="./instances/coloring/graph_color/mulsol.i.3.col">mulsol.i.3.col</a></td>
<td class="right">184</td>
<td class="right">3916</td>
<td class="right">31</td>
<td class="left">REG</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">38</td>
<td class="left"><a href="./instances/coloring/graph_color/mulsol.i.4.col">mulsol.i.4.col</a></td>
<td class="right">185</td>
<td class="right">3946</td>
<td class="right">31</td>
<td class="left">REG</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">39</td>
<td class="left"><a href="./instances/coloring/graph_color/mulsol.i.5.col">mulsol.i.5.col</a></td>
<td class="right">186</td>
<td class="right">3973</td>
<td class="right">31</td>
<td class="left">REG</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">40</td>
<td class="left"><a href="./instances/coloring/graph_color/school1.col">school1.col</a></td>
<td class="right">385</td>
<td class="right">19095</td>
<td class="right">?</td>
<td class="left">SCH</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">41</td>
<td class="left"><a href="./instances/coloring/graph_color/school1_nsh.col">(*)school1_nsh.col</a></td>
<td class="right">352</td>
<td class="right">14612</td>
<td class="right">?</td>
<td class="left">SCH</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">42</td>
<td class="left"><a href="./instances/coloring/graph_color/zeroin.i.1.col">zeroin.i.1.col</a></td>
<td class="right">211</td>
<td class="right">4100</td>
<td class="right">49</td>
<td class="left">REG</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">43</td>
<td class="left"><a href="./instances/coloring/graph_color/zeroin.i.2.col">zeroin.i.2.col</a></td>
<td class="right">211</td>
<td class="right">3541</td>
<td class="right">30</td>
<td class="left">REG</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">44</td>
<td class="left"><a href="./instances/coloring/graph_color/zeroin.i.3.col">zeroin.i.3.col</a></td>
<td class="right">206</td>
<td class="right">3540</td>
<td class="right">30</td>
<td class="left">REG</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">45</td>
<td class="left"><a href="./instances/coloring/graph_color/anna.col">anna.col</a></td>
<td class="right">138</td>
<td class="right">493</td>
<td class="right">11</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">46</td>
<td class="left"><a href="./instances/coloring/graph_color/david.col">david.col</a></td>
<td class="right">87</td>
<td class="right">406</td>
<td class="right">11</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">47</td>
<td class="left"><a href="./instances/coloring/graph_color/homer.col">homer.col</a></td>
<td class="right">561</td>
<td class="right">1629</td>
<td class="right">13</td>
<td class="left">SGB</td>
<td class="left"># edges should be<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup> 1628 + 1 self-loop edge<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup></td>
</tr>

<tr>
<td class="right">48</td>
<td class="left"><a href="./instances/coloring/graph_color/huck.col">huck.col</a></td>
<td class="right">74</td>
<td class="right">301</td>
<td class="right">11</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">49</td>
<td class="left"><a href="./instances/coloring/graph_color/jean.col">jean.col</a></td>
<td class="right">80</td>
<td class="right">254</td>
<td class="right">10</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">50</td>
<td class="left"><a href="./instances/coloring/graph_color/games120.col">games120.col</a></td>
<td class="right">120</td>
<td class="right">638</td>
<td class="right">9</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">51</td>
<td class="left"><a href="./instances/coloring/graph_color/miles1000.col">miles1000.col</a></td>
<td class="right">128</td>
<td class="right">3216</td>
<td class="right">42</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">52</td>
<td class="left"><a href="./instances/coloring/graph_color/miles1500.col">miles1500.col</a></td>
<td class="right">128</td>
<td class="right">5198</td>
<td class="right">73</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">53</td>
<td class="left"><a href="./instances/coloring/graph_color/miles250.col">miles250.col</a></td>
<td class="right">128</td>
<td class="right">387</td>
<td class="right">8</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">54</td>
<td class="left"><a href="./instances/coloring/graph_color/miles500.col">miles500.col</a></td>
<td class="right">128</td>
<td class="right">1170</td>
<td class="right">20</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">55</td>
<td class="left"><a href="./instances/coloring/graph_color/miles750.col">miles750.col</a></td>
<td class="right">128</td>
<td class="right">2113</td>
<td class="right">31</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">56</td>
<td class="left"><a href="./instances/coloring/graph_color/queen5_5.col">queen5_5.col</a></td>
<td class="right">25</td>
<td class="right">160</td>
<td class="right">5</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">57</td>
<td class="left"><a href="./instances/coloring/graph_color/queen6_6.col">queen6_6.col</a></td>
<td class="right">36</td>
<td class="right">290</td>
<td class="right">7</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">58</td>
<td class="left"><a href="./instances/coloring/graph_color/queen7_7.col">queen7_7.col</a></td>
<td class="right">49</td>
<td class="right">476</td>
<td class="right">7</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">59</td>
<td class="left"><a href="./instances/coloring/graph_color/queen8_12.col">(*)queen8_12.col</a></td>
<td class="right">96</td>
<td class="right">1368</td>
<td class="right">12</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">60</td>
<td class="left"><a href="./instances/coloring/graph_color/queen8_8.col">(*)queen8_8.col</a></td>
<td class="right">64</td>
<td class="right">728</td>
<td class="right">9</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">61</td>
<td class="left"><a href="./instances/coloring/graph_color/queen9_9.col">(*)queen9_9.col</a></td>
<td class="right">81</td>
<td class="right">2112</td>
<td class="right">10</td>
<td class="left">SGB</td>
<td class="left"># edges should be<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup> 1056</td>
</tr>

<tr>
<td class="right">62</td>
<td class="left"><a href="./instances/coloring/graph_color/queen10_10.col">(*)queen10_10.col</a></td>
<td class="right">100</td>
<td class="right">2940</td>
<td class="right">?</td>
<td class="left">SGB</td>
<td class="left"># edges should be<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup> 1470</td>
</tr>

<tr>
<td class="right">63</td>
<td class="left"><a href="./instances/coloring/graph_color/queen11_11.col">(*)queen11_11.col</a></td>
<td class="right">121</td>
<td class="right">3960</td>
<td class="right">11</td>
<td class="left">SGB</td>
<td class="left"># edges should be<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup> 1980</td>
</tr>

<tr>
<td class="right">64</td>
<td class="left"><a href="./instances/coloring/graph_color/queen12_12.col">(*)queen12_12.col</a></td>
<td class="right">144</td>
<td class="right">5192</td>
<td class="right">?</td>
<td class="left">SGB</td>
<td class="left"># edges should be<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup> 2596</td>
</tr>

<tr>
<td class="right">65</td>
<td class="left"><a href="./instances/coloring/graph_color/queen13_13.col">(*)queen13_13.col</a></td>
<td class="right">169</td>
<td class="right">6656</td>
<td class="right">13</td>
<td class="left">SGB</td>
<td class="left"># edges should be<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup> 3328</td>
</tr>

<tr>
<td class="right">66</td>
<td class="left"><a href="./instances/coloring/graph_color/queen14_14.col">(*)queen14_14.col</a></td>
<td class="right">196</td>
<td class="right">8372</td>
<td class="right">?</td>
<td class="left">SGB</td>
<td class="left"># edges should be<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup> 4186</td>
</tr>

<tr>
<td class="right">67</td>
<td class="left"><a href="./instances/coloring/graph_color/queen15_15.col">(*)queen15_15.col</a></td>
<td class="right">225</td>
<td class="right">10360</td>
<td class="right">?</td>
<td class="left">SGB</td>
<td class="left"># edges should be<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup> 5180</td>
</tr>

<tr>
<td class="right">68</td>
<td class="left"><a href="./instances/coloring/graph_color/queen16_16.col">(*)queen16_16.col</a></td>
<td class="right">256</td>
<td class="right">12640</td>
<td class="right">?</td>
<td class="left">SGB</td>
<td class="left"># edges should be<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup> 6320</td>
</tr>

<tr>
<td class="right">69</td>
<td class="left"><a href="./instances/coloring/graph_color/myciel3.col">myciel3.col</a></td>
<td class="right">11</td>
<td class="right">20</td>
<td class="right">4</td>
<td class="left">MYC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">70</td>
<td class="left"><a href="./instances/coloring/graph_color/myciel4.col">myciel4.col</a></td>
<td class="right">23</td>
<td class="right">71</td>
<td class="right">5</td>
<td class="left">MYC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">71</td>
<td class="left"><a href="./instances/coloring/graph_color/myciel5.col">(*)myciel5.col</a></td>
<td class="right">47</td>
<td class="right">236</td>
<td class="right">6</td>
<td class="left">MYC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">72</td>
<td class="left"><a href="./instances/coloring/graph_color/myciel6.col">(*)myciel6.col</a></td>
<td class="right">95</td>
<td class="right">755</td>
<td class="right">7</td>
<td class="left">MYC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">73</td>
<td class="left"><a href="./instances/coloring/graph_color/myciel7.col">(*)myciel7.col</a></td>
<td class="right">191</td>
<td class="right">2360</td>
<td class="right">8</td>
<td class="left">MYC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">74</td>
<td class="left"><a href="./instances/coloring/graph_color/mug88_1.col">mugg88_1.col</a></td>
<td class="right">88</td>
<td class="right">146</td>
<td class="right">4</td>
<td class="left">MIZ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">75</td>
<td class="left"><a href="./instances/coloring/graph_color/mug88_25.col">mugg88_25.col</a></td>
<td class="right">88</td>
<td class="right">146</td>
<td class="right">4</td>
<td class="left">MIZ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">76</td>
<td class="left"><a href="./instances/coloring/graph_color/mug100_1.col">mugg100_1.col</a></td>
<td class="right">100</td>
<td class="right">166</td>
<td class="right">4</td>
<td class="left">MIZ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">77</td>
<td class="left"><a href="./instances/coloring/graph_color/mug100_25.col">(*)mugg100_25.col</a></td>
<td class="right">100</td>
<td class="right">166</td>
<td class="right">4</td>
<td class="left">MIZ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">78</td>
<td class="left"><a href="./instances/coloring/graph_color/abb313GPIA.col">abb313GPIA.col</a></td>
<td class="right">1557</td>
<td class="right">53356</td>
<td class="right">?</td>
<td class="left">HOS</td>
<td class="left">corrected 12/29/03</td>
</tr>

<tr>
<td class="right">79</td>
<td class="left"><a href="./instances/coloring/graph_color/ash331GPIA.col">ash331GPIA.col</a></td>
<td class="right">662</td>
<td class="right">4185</td>
<td class="right">?</td>
<td class="left">HOS</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">80</td>
<td class="left"><a href="./instances/coloring/graph_color/ash608GPIA.col">ash608GPIA.col</a></td>
<td class="right">1216</td>
<td class="right">7844</td>
<td class="right">?</td>
<td class="left">HOS</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">81</td>
<td class="left"><a href="./instances/coloring/graph_color/ash958GPIA.col">ash958GPIA.col</a></td>
<td class="right">1916</td>
<td class="right">12506</td>
<td class="right">?</td>
<td class="left">HOS</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">82</td>
<td class="left"><a href="./instances/coloring/graph_color/will199GPIA.col">will199GPIA.col</a></td>
<td class="right">701</td>
<td class="right">6772</td>
<td class="right">?</td>
<td class="left">HOS</td>
<td class="left">corrected 12/29/03</td>
</tr>

<tr>
<td class="right">83</td>
<td class="left"><a href="./instances/coloring/graph_color/1-Insertions_4.col">(*)1-Insertions_4.col</a></td>
<td class="right">67</td>
<td class="right">232</td>
<td class="right">4</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">84</td>
<td class="left"><a href="./instances/coloring/graph_color/1-Insertions_5.col">(*)1-Insertions_5.col</a></td>
<td class="right">202</td>
<td class="right">1227</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">85</td>
<td class="left"><a href="./instances/coloring/graph_color/1-Insertions_6.col">(*)1-Insertions_6.col</a></td>
<td class="right">607</td>
<td class="right">6337</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">86</td>
<td class="left"><a href="./instances/coloring/graph_color/2-Insertions_3.col">(*)2-Insertions_3.col</a></td>
<td class="right">37</td>
<td class="right">72</td>
<td class="right">4</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">87</td>
<td class="left"><a href="./instances/coloring/graph_color/2-Insertions_4.col">(*)2-Insertions_4.col</a></td>
<td class="right">149</td>
<td class="right">541</td>
<td class="right">4</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">88</td>
<td class="left"><a href="./instances/coloring/graph_color/2-Insertions_5.col">(*)2-Insertions_5.col</a></td>
<td class="right">597</td>
<td class="right">3936</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">89</td>
<td class="left"><a href="./instances/coloring/graph_color/3-Insertions_3.col">(*)3-Insertions_3.col</a></td>
<td class="right">56</td>
<td class="right">110</td>
<td class="right">4</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">90</td>
<td class="left"><a href="./instances/coloring/graph_color/3-Insertions_4.col">(*)3-Insertions_4.col</a></td>
<td class="right">281</td>
<td class="right">1046</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">91</td>
<td class="left"><a href="./instances/coloring/graph_color/3-Insertions_5.col">(*)3-Insertions_5.col</a></td>
<td class="right">1406</td>
<td class="right">9695</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">92</td>
<td class="left"><a href="./instances/coloring/graph_color/4-Insertions_3.col">(*)4-Insertions_3.col</a></td>
<td class="right">79</td>
<td class="right">156</td>
<td class="right">3</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">93</td>
<td class="left"><a href="./instances/coloring/graph_color/4-Insertions_4.col">(*)4-Insertions_4.col</a></td>
<td class="right">475</td>
<td class="right">1795</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">94</td>
<td class="left"><a href="./instances/coloring/graph_color/1-FullIns_3.col">(*)1-FullIns_3.col</a></td>
<td class="right">30</td>
<td class="right">100</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">95</td>
<td class="left"><a href="./instances/coloring/graph_color/1-FullIns_4.col">(*)1-FullIns_4.col</a></td>
<td class="right">93</td>
<td class="right">593</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">96</td>
<td class="left"><a href="./instances/coloring/graph_color/1-FullIns_5.col">(*)1-FullIns_5.col</a></td>
<td class="right">282</td>
<td class="right">3247</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">97</td>
<td class="left"><a href="./instances/coloring/graph_color/2-FullIns_3.col">(*)2-FullIns_3.col</a></td>
<td class="right">52</td>
<td class="right">201</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">98</td>
<td class="left"><a href="./instances/coloring/graph_color/2-FullIns_4.col">(*)2-FullIns_4.col</a></td>
<td class="right">212</td>
<td class="right">1621</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">99</td>
<td class="left"><a href="./instances/coloring/graph_color/2-FullIns_5.col">(*)2-FullIns_5.col</a></td>
<td class="right">852</td>
<td class="right">12201</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">100</td>
<td class="left"><a href="./instances/coloring/graph_color/3-FullIns_3.col">(*)3-FullIns_3.col</a></td>
<td class="right">80</td>
<td class="right">346</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">101</td>
<td class="left"><a href="./instances/coloring/graph_color/3-FullIns_4.col">(*)3-FullIns_4.col</a></td>
<td class="right">405</td>
<td class="right">3524</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">102</td>
<td class="left"><a href="./instances/coloring/graph_color/3-FullIns_5.col">(*)3-FullIns_5.col</a></td>
<td class="right">2030</td>
<td class="right">33751</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">103</td>
<td class="left"><a href="./instances/coloring/graph_color/4-FullIns_3.col">(*)4-FullIns_3.col</a></td>
<td class="right">114</td>
<td class="right">541</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">104</td>
<td class="left"><a href="./instances/coloring/graph_color/4-FullIns_4.col">(*)4-FullIns_4.col</a></td>
<td class="right">690</td>
<td class="right">6650</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">105</td>
<td class="left"><a href="./instances/coloring/graph_color/4-FullIns_5.col">(*)4-FullIns_5.col</a></td>
<td class="right">4146</td>
<td class="right">77305</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">106</td>
<td class="left"><a href="./instances/coloring/graph_color/5-FullIns_3.col">(*)5-FullIns_3.col</a></td>
<td class="right">154</td>
<td class="right">792</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">107</td>
<td class="left"><a href="./instances/coloring/graph_color/5-FullIns_4.col">(*)5-FullIns_4.col</a></td>
<td class="right">1085</td>
<td class="right">11395</td>
<td class="right">?</td>
<td class="left">CAR</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">108</td>
<td class="left"><a href="./instances/coloring/graph_color/wap01a.col">wap01a.col</a></td>
<td class="right">2368</td>
<td class="right">110871</td>
<td class="right">?</td>
<td class="left">KOS</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">109</td>
<td class="left"><a href="./instances/coloring/graph_color/wap02a.col">wap02a.col</a></td>
<td class="right">2464</td>
<td class="right">111742</td>
<td class="right">?</td>
<td class="left">KOS</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">110</td>
<td class="left"><a href="./instances/coloring/graph_color/wap03a.col">wap03a.col</a></td>
<td class="right">4730</td>
<td class="right">286722</td>
<td class="right">?</td>
<td class="left">KOS</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">111</td>
<td class="left"><a href="./instances/coloring/graph_color/wap04a.col">wap04a.col</a></td>
<td class="right">5231</td>
<td class="right">294902</td>
<td class="right">?</td>
<td class="left">KOS</td>
<td class="left"># vertices &gt; 5000</td>
</tr>

<tr>
<td class="right">112</td>
<td class="left"><a href="./instances/coloring/graph_color/wap05a.col">wap05a.col</a></td>
<td class="right">905</td>
<td class="right">43081</td>
<td class="right">?</td>
<td class="left">KOS</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">113</td>
<td class="left"><a href="./instances/coloring/graph_color/wap06a.col">wap06a.col</a></td>
<td class="right">947</td>
<td class="right">43571</td>
<td class="right">?</td>
<td class="left">KOS</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">114</td>
<td class="left"><a href="./instances/coloring/graph_color/wap07a.col">wap07a.col</a></td>
<td class="right">1809</td>
<td class="right">103368</td>
<td class="right">?</td>
<td class="left">KOS</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">115</td>
<td class="left"><a href="./instances/coloring/graph_color/wap08a.col">wap08a.col</a></td>
<td class="right">1870</td>
<td class="right">104176</td>
<td class="right">?</td>
<td class="left">KOS</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">116</td>
<td class="left"><a href="./instances/coloring/graph_color/qg.order30.col">qg.order30.col</a></td>
<td class="right">900</td>
<td class="right">26100</td>
<td class="right">30</td>
<td class="left">GOM</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">117</td>
<td class="left"><a href="./instances/coloring/graph_color/qg.order40.col">qg.order40.col</a></td>
<td class="right">1600</td>
<td class="right">62400</td>
<td class="right">40</td>
<td class="left">GOM</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">118</td>
<td class="left"><a href="./instances/coloring/graph_color/qg.order60.col">qg.order60.col</a></td>
<td class="right">3600</td>
<td class="right">212400</td>
<td class="right">60</td>
<td class="left">GOM</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">119</td>
<td class="left"><a href="./instances/coloring/graph_color/qg.order100.col">qg.order100.col</a></td>
<td class="right">10000</td>
<td class="right">990000</td>
<td class="right">100</td>
<td class="left">GOM</td>
<td class="left"># vertices &gt; 5000</td>
</tr>
</tbody>
</table>
</div>
</div>
