graphcoloring.org
* Coloring with Fixed Set instances
  [[./instances/coloring/fixed_set_color/][Directory]], 
  [[./instances/coloring/fixed_set_color.tar.gz][tar.gz format]] 

In the following, some or all nodes must choose from the sets given by the ~f~ lines.

#+NAME: tab:fixedset
|    | File                                                                                                             | Category | Note |
|----+------------------------------------------------------------------------------------------------------------------+----------+------|
|  1 | [[./instances/coloring/fixed_set_color/qwhdec.order18.holes120.1.col][qqwhdec.order18.holes120.1.col]]           | GOM1     |      |
|  2 | [[./instances/coloring/fixed_set_color/qwhdec.order30.holes316.1.col][qqwhdec.order30.holes316.1.col]]           | GOM1     |      |
|  3 | [[./instances/coloring/fixed_set_color/qwhdec.order30.holes320.1.col][qqwhdec.order30.holes320.1.col]]           | GOM1     |      |
|  4 | [[./instances/coloring/fixed_set_color/qwhdec.order33.holes381al.1.col][qqwhdec.order33.holes381al.1.col]]       | GOM1     |      |
|  5 | [[./instances/coloring/fixed_set_color/qwhdec.order35.holes405.1.col][qqwhdec.order35.holes405.1.col]]           | GOM1     |      |
|  6 | [[./instances/coloring/fixed_set_color/qwhdec.order40.holes528.1.col][qqwhdec.order40.holes528.1.col]]           | GOM1     |      |
|  7 | [[./instances/coloring/fixed_set_color/qwhdec.order5.holes10.1.col][qqwhdec.order5.holes10.1.col]]               | GOM1     |      |
|  8 | [[./instances/coloring/fixed_set_color/qwhdec.order50.holes750al.1.col][qqwhdec.order50.holes750al.1.col]]       | GOM1     |      |
|  9 | [[./instances/coloring/fixed_set_color/qwhdec.order50.holes825al.1.col][qqwhdec.order50.holes825al.1.col]]       | GOM1     |      |
| 10 | [[./instances/coloring/fixed_set_color/qwhdec.order60.holes1080al.1.col][qqwhdec.order60.holes1080al.1.col]]     | GOM1     |      |
| 11 | [[./instances/coloring/fixed_set_color/qwhdec.order60.holes1152al.1.col][qqwhdec.order60.holes1152al.1.col]]     | GOM1     |      |
| 12 | [[./instances/coloring/fixed_set_color/qwhdec.order60.holes1440.1.col][qqwhdec.order60.holes1440.1.col]]         | GOM1     |      |
| 13 | [[./instances/coloring/fixed_set_color/qwhdec.order60.holes1620.1.col][qqwhdec.order60.holes1620.1.col]]         | GOM1     |      |
| 14 | [[./instances/coloring/fixed_set_color/qwhdec.order70.holes2450.1.col][qqwhdec.order70.holes2450.1.col]]         | GOM1     |      |
| 15 | [[./instances/coloring/fixed_set_color/qwhdec.order70.holes2940.1.col][qqwhdec.order70.holes2940.1.col]]         | GOM1     |      |
| 16 | [[./instances/coloring/fixed_set_color/qwhopt.order18.holes120.1.col][qqwhopt.order18.holes120.1.col]]           | GOM1     |      |
| 17 | [[./instances/coloring/fixed_set_color/qwhopt.order30.holes316.1.col][qqwhopt.order30.holes316.1.col]]           | GOM1     |      |
| 18 | [[./instances/coloring/fixed_set_color/qwhopt.order30.holes320.1.col][qqwhopt.order30.holes320.1.col]]           | GOM1     |      |
| 19 | [[./instances/coloring/fixed_set_color/qwhopt.order33.holes381al.1.col][qqwhopt.order33.holes381al.1.col]]       | GOM1     |      |
| 20 | [[./instances/coloring/fixed_set_color/qwhopt.order35.holes405.1.col][qqwhopt.order35.holes405.1.col]]           | GOM1     |      |
| 21 | [[./instances/coloring/fixed_set_color/qwhopt.order40.holes528.1.col][qqwhopt.order40.holes528.1.col]]           | GOM1     |      |
| 22 | [[./instances/coloring/fixed_set_color/qwhopt.order5.holes10.1.col][qqwhopt.order5.holes10.1.col]]               | GOM1     |      |
| 23 | [[./instances/coloring/fixed_set_color/qwhopt.order50.holes750.bal.1.col][qqwhopt.order50.holes750.bal.1.col]]   | GOM1     |      |
| 24 | [[./instances/coloring/fixed_set_color/qwhopt.order50.holes825.bal.1.col][qqwhopt.order50.holes825.bal.1.col]]   | GOM1     |      |
| 25 | [[./instances/coloring/fixed_set_color/qwhopt.order60.holes1080.bal.1.col][qqwhopt.order60.holes1080.bal.1.col]] | GOM1     |      |
| 26 | [[./instances/coloring/fixed_set_color/qwhopt.order60.holes1152.bal.1.col][qqwhopt.order60.holes1152.bal.1.col]] | GOM1     |      |
| 27 | [[./instances/coloring/fixed_set_color/qwhopt.order60.holes1440.1.col][qqwhopt.order60.holes1440.1.col]]         | GOM1     |      |
| 28 | [[./instances/coloring/fixed_set_color/qwhopt.order60.holes1620.1.col][qqwhopt.order60.holes1620.1.col]]         | GOM1     |      |
| 29 | [[./instances/coloring/fixed_set_color/qwhopt.order70.holes2450.1.col][qqwhopt.order70.holes2450.1.col]]         | GOM1     |      |
| 30 | [[./instances/coloring/fixed_set_color/qwhopt.order70.holes2940.1.col][qwhopt.order70.holes2940.1.col]]          | GOM1     |      |
|----+------------------------------------------------------------------------------------------------------------------+----------+------|
#+tblfm: $1=@#-1   

