graphcoloring.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Coloring with Fixed Set instances</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="./instances/coloring/fixed_set_color/">Directory</a>, 
<a href="./instances/coloring/fixed_set_color.tar.gz">tar.gz format</a> 
</p>

<p>
In the following, some or all nodes must choose from the sets given by the <code>f</code> lines.
</p>

<table id="tab:fixedset" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left">File</th>
<th scope="col" class="left">Category</th>
<th scope="col" class="left">Note</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhdec.order18.holes120.1.col">qqwhdec.order18.holes120.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhdec.order30.holes316.1.col">qqwhdec.order30.holes316.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhdec.order30.holes320.1.col">qqwhdec.order30.holes320.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhdec.order33.holes381al.1.col">qqwhdec.order33.holes381al.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">5</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhdec.order35.holes405.1.col">qqwhdec.order35.holes405.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhdec.order40.holes528.1.col">qqwhdec.order40.holes528.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">7</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhdec.order5.holes10.1.col">qqwhdec.order5.holes10.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">8</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhdec.order50.holes750al.1.col">qqwhdec.order50.holes750al.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">9</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhdec.order50.holes825al.1.col">qqwhdec.order50.holes825al.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">10</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhdec.order60.holes1080al.1.col">qqwhdec.order60.holes1080al.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">11</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhdec.order60.holes1152al.1.col">qqwhdec.order60.holes1152al.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">12</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhdec.order60.holes1440.1.col">qqwhdec.order60.holes1440.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">13</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhdec.order60.holes1620.1.col">qqwhdec.order60.holes1620.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">14</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhdec.order70.holes2450.1.col">qqwhdec.order70.holes2450.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">15</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhdec.order70.holes2940.1.col">qqwhdec.order70.holes2940.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">16</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhopt.order18.holes120.1.col">qqwhopt.order18.holes120.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">17</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhopt.order30.holes316.1.col">qqwhopt.order30.holes316.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">18</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhopt.order30.holes320.1.col">qqwhopt.order30.holes320.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">19</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhopt.order33.holes381al.1.col">qqwhopt.order33.holes381al.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">20</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhopt.order35.holes405.1.col">qqwhopt.order35.holes405.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">21</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhopt.order40.holes528.1.col">qqwhopt.order40.holes528.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">22</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhopt.order5.holes10.1.col">qqwhopt.order5.holes10.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">23</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhopt.order50.holes750.bal.1.col">qqwhopt.order50.holes750.bal.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">24</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhopt.order50.holes825.bal.1.col">qqwhopt.order50.holes825.bal.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">25</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhopt.order60.holes1080.bal.1.col">qqwhopt.order60.holes1080.bal.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">26</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhopt.order60.holes1152.bal.1.col">qqwhopt.order60.holes1152.bal.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">27</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhopt.order60.holes1440.1.col">qqwhopt.order60.holes1440.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">28</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhopt.order60.holes1620.1.col">qqwhopt.order60.holes1620.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">29</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhopt.order70.holes2450.1.col">qqwhopt.order70.holes2450.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">30</td>
<td class="left"><a href="./instances/coloring/fixed_set_color/qwhopt.order70.holes2940.1.col">qwhopt.order70.holes2940.1.col</a></td>
<td class="left">GOM1</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
