graphcoloring.org
* Bandwidth and Multicoloring instances
  [[./instances/coloring/bandwidth_multicolor/][Directory]], 
  [[./instances/coloring/bandwidth_multicolor.tar.gz][tar.gz format]]
  
  The following can be used in bandwidth (edge weights)
  multicoloring (node weights) or both simply by ignoring unwanted
  information (edge weights for multicoloring and node weights for
  bandwidth). They can even be used for graph coloring by ignoring
  both!

#+NAME: tab:bandwidth
|    | File                                                                                         | Vertices | Edges | Sol | Category | Note |
|----+----------------------------------------------------------------------------------------------+----------+-------+-----+----------+------|
|  1 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM20.col][GEOM20.col]]                    |       20 |    40 |     | GEO      |      |
|  2 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM20a.col][GEOM20a.col]]                  |       20 |    57 |     | GEO      |      |
|  3 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM30.col][GEOM30.col]]                    |       30 |    80 |     | GEO      |      |
|  4 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM30a.col][GEOM30a.col]]                  |       30 |   111 |     | GEO      |      |
|  5 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM40.col][GEOM40.col]]                    |       40 |   118 |     | GEO      |      |
|  6 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM40a.col][GEOM40a.col]]                  |       40 |   186 |     | GEO      |      |
|  7 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM50.col][GEOM50.col]]                    |       50 |   177 |     | GEO      |      |
|  8 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM50a.col][GEOM50a.col]]                  |       50 |   288 |     | GEO      |      |
|  9 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM60.col][GEOM60.col]]                    |       60 |   245 |     | GEO      |      |
| 10 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM60a.col][GEOM60a.col]]                  |       60 |   339 |     | GEO      |      |
| 11 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM70.col][GEOM70.col]]                    |       70 |   337 |     | GEO      |      |
| 12 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM70a.col][GEOM70a.col]]                  |       70 |   529 |     | GEO      |      |
| 13 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM80.col][GEOM80.col]]                    |       80 |   429 |     | GEO      |      |
| 14 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM80a.col][GEOM80a.col]]                  |       80 |   692 |     | GEO      |      |
| 15 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM90.col][GEOM90.col]]                    |       90 |   531 |     | GEO      |      |
| 16 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM90a.col][GEOM90a.col]]                  |       90 |   879 |     | GEO      |      |
| 17 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM100.col][GEOM100.col]]                  |      100 |   647 |     | GEO      |      |
| 18 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM100a.col][GEOM100a.col]]                |      100 |  1092 |     | GEO      |      |
| 19 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM110.col][GEOM110.col]]                  |      110 |   748 |     | GEO      |      |
| 20 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM110a.col][GEOM110a.col]]                |      110 |  1317 |     | GEO      |      |
| 21 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM120.col][GEOM120.col]]                  |      120 |   893 |     | GEO      |      |
| 22 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM120a.col][GEOM120a.col]]                |      120 |  1554 |     | GEO      |      |
| 23 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM20b.col][GEOM20b.col]]                  |       20 |    52 |     | GEO      |      |
| 24 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM30b.col][GEOM30b.col]]                  |       30 |   111 |     | GEO      |      |
| 25 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM40b.col][GEOM40b.col]]                  |       40 |   197 |     | GEO      |      |
| 26 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM50b.col][GEOM50b.col]]                  |       50 |   299 |     | GEO      |      |
| 27 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM60b.col][GEOM60b.col]]                  |       60 |   426 |     | GEO      |      |
| 28 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM70b.col][GEOM70b.col]]                  |       70 |   558 |     | GEO      |      |
| 29 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM80b.col][GEOM80b.col]]                  |       80 |   743 |     | GEO      |      |
| 30 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM90b.col][GEOM90b.col]]                  |       90 |   950 |     | GEO      |      |
| 31 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM100b.col][GEOM100b.col]]                |      100 |  1150 |     | GEO      |      |
| 32 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM110b.col][GEOM110b.col]]                |      110 |  1366 |     | GEO      |      |
| 33 | [[./instances/coloring/bandwidth_multicolor/GEOM/GEOM120b.col][GEOM120b.col]]                |      120 |  1611 |     | GEO      |      |
| 34 | [[./instances/coloring/bandwidth_multicolor/Instances_g/DSJC125.1g.col][DSJC125.1g.col]]     |      125 |   736 | ?   | DSJ      |      |
| 35 | [[./instances/coloring/bandwidth_multicolor/Instances_g/DSJC125.5g.col][DSJC125.5g.col]]     |      125 |  3891 | ?   | DSJ      |      |
| 36 | [[./instances/coloring/bandwidth_multicolor/Instances_g/DSJC125.9g.col][DSJC125.9g.col]]     |      125 |  6961 | ?   | DSJ      |      |
| 37 | [[./instances/coloring/bandwidth_multicolor/Instances_g/myciel5g.col][myciel5g.col]]         |       47 |   236 | ?   | MYC      |      |
| 38 | [[./instances/coloring/bandwidth_multicolor/Instances_g/myciel6g.col][myciel6g.col]]         |       95 |   755 | ?   | MYC      |      |
| 39 | [[./instances/coloring/bandwidth_multicolor/Instances_g/myciel7g.col][myciel7g.col]]         |      191 |  2360 | ?   | MYC      |      |
| 40 | [[./instances/coloring/bandwidth_multicolor/Instances_g/queen8_8g.col][queen8_8g.col]]       |       64 |   728 | ?   | SGB      |      |
| 41 | [[./instances/coloring/bandwidth_multicolor/Instances_g/queen9_9g.col][queen9_9g.col]]       |       81 |  2112 | ?   | SGB      |      |
| 42 | [[./instances/coloring/bandwidth_multicolor/Instances_g/queen10_10g.col][queen10_10g.col]]   |      100 |  2940 | ?   | SGB      |      |
| 43 | [[./instances/coloring/bandwidth_multicolor/Instances_g/queen11_11g.col][queen11_11g.col]]   |      121 |  3960 | ?   | SGB      |      |
| 44 | [[./instances/coloring/bandwidth_multicolor/Instances_g/queen12_12g.col][queen12_12g.col]]   |      144 |  5192 | ?   | SGB      |      |
| 45 | [[./instances/coloring/bandwidth_multicolor/Instances_g/DSJC125.1gb.col][DSJC125.1gb.col]]   |      125 |   736 | ?   | DSJ      |      |
| 46 | [[./instances/coloring/bandwidth_multicolor/Instances_g/DSJC125.5gb.col][DSJC125.5gb.col]]   |      125 |  3891 | ?   | DSJ      |      |
| 47 | [[./instances/coloring/bandwidth_multicolor/Instances_g/DSJC125.9gb.col][DSJC125.9gb.col]]   |      125 |  6961 | ?   | DSJ      |      |
| 48 | [[./instances/coloring/bandwidth_multicolor/Instances_g/myciel5gb.col][myciel5gb.col]]       |       47 |   236 | ?   | MYC      |      |
| 49 | [[./instances/coloring/bandwidth_multicolor/Instances_g/myciel6gb.col][myciel6gb.col]]       |       95 |   755 | ?   | MYC      |      |
| 50 | [[./instances/coloring/bandwidth_multicolor/Instances_g/myciel7gb.col][myciel7gb.col]]       |      191 |  2360 | ?   | MYC      |      |
| 51 | [[./instances/coloring/bandwidth_multicolor/Instances_g/queen8_8gb.col][queen8_8gb.col]]     |       64 |   728 | ?   | SGB      |      |
| 52 | [[./instances/coloring/bandwidth_multicolor/Instances_g/queen9_9gb.col][queen9_9gb.col]]     |       81 |  2112 | ?   | SGB      |      |
| 53 | [[./instances/coloring/bandwidth_multicolor/Instances_g/queen10_10gb.col][queen10_10gb.col]] |      100 |  2940 | ?   | SGB      |      |
| 54 | [[./instances/coloring/bandwidth_multicolor/Instances_g/queen11_11gb.col][queen11_11gb.col]] |      121 |  3960 | ?   | SGB      |      |
| 55 | [[./instances/coloring/bandwidth_multicolor/Instances_g/queen12_12gb.col][queen12_12gb.col]] |      144 |  5192 | ?   | SGB      |      |
| 56 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R50_1g.col][R50_1g.col]]             |          |       |     | MUC      |      |
| 57 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R50_5g.col][R50_5g.col]]             |          |       |     | MUC      |      |
| 58 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R50_9g.col][R50_9g.col]]             |          |       |     | MUC      |      |
| 59 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R75_1g.col][R75_1g.col]]             |          |       |     | MUC      |      |
| 60 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R75_5g.col][R75_5g.col]]             |          |       |     | MUC      |      |
| 61 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R75_9g.col][R75_9g.col]]             |          |       |     | MUC      |      |
| 62 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R100_1g.col][R100_1g.col]]           |          |       |     | MUC      |      |
| 63 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R100_5g.col][R100_5g.col]]           |          |       |     | MUC      |      |
| 64 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R100_9g.col][R100_9g.col]]           |          |       |     | MUC      |      |
| 65 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R50_1gb.col][R50_1gb.col]]           |          |       |     | MUC      |      |
| 66 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R50_5gb.col][R50_5gb.col]]           |          |       |     | MUC      |      |
| 67 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R50_9gb.col][R50_9gb.col]]           |          |       |     | MUC      |      |
| 68 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R75_1gb.col][R75_1gb.col]]           |          |       |     | MUC      |      |
| 69 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R75_5gb.col][R75_5gb.col]]           |          |       |     | MUC      |      |
| 70 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R75_9gb.col][R75_9gb.col]]           |          |       |     | MUC      |      |
| 71 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R100_1gb.col][R100_1gb.col]]         |          |       |     | MUC      |      |
| 72 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R100_5gb.col][R100_5gb.col]]         |          |       |     | MUC      |      |
| 73 | [[./instances/coloring/bandwidth_multicolor/Instances_g/R100_9gb.col][R100_9gb.col]]         |          |       |     | MUC      |      |
|----+----------------------------------------------------------------------------------------------+----------+-------+-----+----------+------|
#+tblfm: $1=@#-1   

