graphcoloring.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Bandwidth and Multicoloring instances</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="./instances/coloring/bandwidth_multicolor/">Directory</a>, 
<a href="./instances/coloring/bandwidth_multicolor.tar.gz">tar.gz format</a>
</p>

<p>
The following can be used in bandwidth (edge weights)
multicoloring (node weights) or both simply by ignoring unwanted
information (edge weights for multicoloring and node weights for
bandwidth). They can even be used for graph coloring by ignoring
both!
</p>

<table id="tab:bandwidth" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left">File</th>
<th scope="col" class="right">Vertices</th>
<th scope="col" class="right">Edges</th>
<th scope="col" class="left">Sol</th>
<th scope="col" class="left">Category</th>
<th scope="col" class="left">Note</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM20.col">GEOM20.col</a></td>
<td class="right">20</td>
<td class="right">40</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM20a.col">GEOM20a.col</a></td>
<td class="right">20</td>
<td class="right">57</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM30.col">GEOM30.col</a></td>
<td class="right">30</td>
<td class="right">80</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM30a.col">GEOM30a.col</a></td>
<td class="right">30</td>
<td class="right">111</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">5</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM40.col">GEOM40.col</a></td>
<td class="right">40</td>
<td class="right">118</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM40a.col">GEOM40a.col</a></td>
<td class="right">40</td>
<td class="right">186</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">7</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM50.col">GEOM50.col</a></td>
<td class="right">50</td>
<td class="right">177</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">8</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM50a.col">GEOM50a.col</a></td>
<td class="right">50</td>
<td class="right">288</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">9</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM60.col">GEOM60.col</a></td>
<td class="right">60</td>
<td class="right">245</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">10</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM60a.col">GEOM60a.col</a></td>
<td class="right">60</td>
<td class="right">339</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">11</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM70.col">GEOM70.col</a></td>
<td class="right">70</td>
<td class="right">337</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">12</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM70a.col">GEOM70a.col</a></td>
<td class="right">70</td>
<td class="right">529</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">13</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM80.col">GEOM80.col</a></td>
<td class="right">80</td>
<td class="right">429</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">14</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM80a.col">GEOM80a.col</a></td>
<td class="right">80</td>
<td class="right">692</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">15</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM90.col">GEOM90.col</a></td>
<td class="right">90</td>
<td class="right">531</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">16</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM90a.col">GEOM90a.col</a></td>
<td class="right">90</td>
<td class="right">879</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">17</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM100.col">GEOM100.col</a></td>
<td class="right">100</td>
<td class="right">647</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">18</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM100a.col">GEOM100a.col</a></td>
<td class="right">100</td>
<td class="right">1092</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">19</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM110.col">GEOM110.col</a></td>
<td class="right">110</td>
<td class="right">748</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">20</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM110a.col">GEOM110a.col</a></td>
<td class="right">110</td>
<td class="right">1317</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">21</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM120.col">GEOM120.col</a></td>
<td class="right">120</td>
<td class="right">893</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">22</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM120a.col">GEOM120a.col</a></td>
<td class="right">120</td>
<td class="right">1554</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">23</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM20b.col">GEOM20b.col</a></td>
<td class="right">20</td>
<td class="right">52</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">24</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM30b.col">GEOM30b.col</a></td>
<td class="right">30</td>
<td class="right">111</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">25</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM40b.col">GEOM40b.col</a></td>
<td class="right">40</td>
<td class="right">197</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">26</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM50b.col">GEOM50b.col</a></td>
<td class="right">50</td>
<td class="right">299</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">27</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM60b.col">GEOM60b.col</a></td>
<td class="right">60</td>
<td class="right">426</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">28</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM70b.col">GEOM70b.col</a></td>
<td class="right">70</td>
<td class="right">558</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">29</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM80b.col">GEOM80b.col</a></td>
<td class="right">80</td>
<td class="right">743</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">30</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM90b.col">GEOM90b.col</a></td>
<td class="right">90</td>
<td class="right">950</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">31</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM100b.col">GEOM100b.col</a></td>
<td class="right">100</td>
<td class="right">1150</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">32</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM110b.col">GEOM110b.col</a></td>
<td class="right">110</td>
<td class="right">1366</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">33</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/GEOM/GEOM120b.col">GEOM120b.col</a></td>
<td class="right">120</td>
<td class="right">1611</td>
<td class="left">&#xa0;</td>
<td class="left">GEO</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">34</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/DSJC125.1g.col">DSJC125.1g.col</a></td>
<td class="right">125</td>
<td class="right">736</td>
<td class="left">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">35</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/DSJC125.5g.col">DSJC125.5g.col</a></td>
<td class="right">125</td>
<td class="right">3891</td>
<td class="left">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">36</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/DSJC125.9g.col">DSJC125.9g.col</a></td>
<td class="right">125</td>
<td class="right">6961</td>
<td class="left">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">37</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/myciel5g.col">myciel5g.col</a></td>
<td class="right">47</td>
<td class="right">236</td>
<td class="left">?</td>
<td class="left">MYC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">38</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/myciel6g.col">myciel6g.col</a></td>
<td class="right">95</td>
<td class="right">755</td>
<td class="left">?</td>
<td class="left">MYC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">39</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/myciel7g.col">myciel7g.col</a></td>
<td class="right">191</td>
<td class="right">2360</td>
<td class="left">?</td>
<td class="left">MYC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">40</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/queen8_8g.col">queen8_8g.col</a></td>
<td class="right">64</td>
<td class="right">728</td>
<td class="left">?</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">41</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/queen9_9g.col">queen9_9g.col</a></td>
<td class="right">81</td>
<td class="right">2112</td>
<td class="left">?</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">42</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/queen10_10g.col">queen10_10g.col</a></td>
<td class="right">100</td>
<td class="right">2940</td>
<td class="left">?</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">43</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/queen11_11g.col">queen11_11g.col</a></td>
<td class="right">121</td>
<td class="right">3960</td>
<td class="left">?</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">44</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/queen12_12g.col">queen12_12g.col</a></td>
<td class="right">144</td>
<td class="right">5192</td>
<td class="left">?</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">45</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/DSJC125.1gb.col">DSJC125.1gb.col</a></td>
<td class="right">125</td>
<td class="right">736</td>
<td class="left">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">46</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/DSJC125.5gb.col">DSJC125.5gb.col</a></td>
<td class="right">125</td>
<td class="right">3891</td>
<td class="left">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">47</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/DSJC125.9gb.col">DSJC125.9gb.col</a></td>
<td class="right">125</td>
<td class="right">6961</td>
<td class="left">?</td>
<td class="left">DSJ</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">48</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/myciel5gb.col">myciel5gb.col</a></td>
<td class="right">47</td>
<td class="right">236</td>
<td class="left">?</td>
<td class="left">MYC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">49</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/myciel6gb.col">myciel6gb.col</a></td>
<td class="right">95</td>
<td class="right">755</td>
<td class="left">?</td>
<td class="left">MYC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">50</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/myciel7gb.col">myciel7gb.col</a></td>
<td class="right">191</td>
<td class="right">2360</td>
<td class="left">?</td>
<td class="left">MYC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">51</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/queen8_8gb.col">queen8_8gb.col</a></td>
<td class="right">64</td>
<td class="right">728</td>
<td class="left">?</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">52</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/queen9_9gb.col">queen9_9gb.col</a></td>
<td class="right">81</td>
<td class="right">2112</td>
<td class="left">?</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">53</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/queen10_10gb.col">queen10_10gb.col</a></td>
<td class="right">100</td>
<td class="right">2940</td>
<td class="left">?</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">54</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/queen11_11gb.col">queen11_11gb.col</a></td>
<td class="right">121</td>
<td class="right">3960</td>
<td class="left">?</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">55</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/queen12_12gb.col">queen12_12gb.col</a></td>
<td class="right">144</td>
<td class="right">5192</td>
<td class="left">?</td>
<td class="left">SGB</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">56</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R50_1g.col">R50_1g.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">57</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R50_5g.col">R50_5g.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">58</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R50_9g.col">R50_9g.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">59</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R75_1g.col">R75_1g.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">60</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R75_5g.col">R75_5g.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">61</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R75_9g.col">R75_9g.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">62</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R100_1g.col">R100_1g.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">63</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R100_5g.col">R100_5g.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">64</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R100_9g.col">R100_9g.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">65</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R50_1gb.col">R50_1gb.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">66</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R50_5gb.col">R50_5gb.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">67</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R50_9gb.col">R50_9gb.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">68</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R75_1gb.col">R75_1gb.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">69</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R75_5gb.col">R75_5gb.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">70</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R75_9gb.col">R75_9gb.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">71</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R100_1gb.col">R100_1gb.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">72</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R100_5gb.col">R100_5gb.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">73</td>
<td class="left"><a href="./instances/coloring/bandwidth_multicolor/Instances_g/R100_9gb.col">R100_9gb.col</a></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MUC</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
