graphcoloring.org
* Categories
 - DSJ :: (From David Johnson, dsj@research.att.com) Random graphs used in his paper with Aragon,  McGeoch,  and Schevon, "Optimization by Simulated Annealing: An Experimental Evaluation; Part II, Graph  Coloring and Number Partitioning",  Operations Research,  31,  378--406 (1991).

  DSJC are standard (n , p) random graphs. DSJR are geometric graphs with DSJR..c being complements of geometric graphs. In some papers the edge count is twice that given here since both (i , j) and (j , i) are counted.

 - CUL :: (From Joe Culberson (joe@cs.ualberta.ca)) Quasi-random coloring problem.

 - REG :: (From Gary Lewandowski (gary@cs.wisc.edu)) Problem based on register allocation for variables in real codes.
 - LEI :: (From Craig Morgenstern (morgenst@riogrande.cs.tcu.edu)) Leighton graphs with guaranteed coloring size. A reference is F.T. Leighton,  Journal of Research of the National Bureau of Standards, 84: 489--505 (1979).

 - SCH :: (From Gary Lewandowski (lewandow@cs.wisc.edu)): Class scheduling graphs with and without study halls.

 - LAT :: (From Gary Lewandowski (lewandow@cs.wisc.edu)): Latin square problem.

 - SGB :: (From Michael Trick (trick@cmu.edu) Graphs from Donald Knuth's Stanford GraphBase. These can be divided into:
    - Book Graphs :: Given a work of literature,  a graph is created where each node represents a character. Two nodes are connected by an edge if the corresponding characters encounter each other in the book. Knuth creates the graphs for five classic works: Tolstoy's Anna Karenina (~anna~), Dicken's David Copperfield (~david~), Homer's Iliad (~homer~), Twain's Huckleberry Finn (~huck~), and Hugo's Les Miserables (~jean~).
		     
    - Game Graphs :: A graph representing the games played in a
        college football season can be represented by a graph where the
        nodes represent each college team. Two teams are connected by
        an edge if they played each other during the season. Knuth
        gives the graph for the 1990 college football season.

    - Miles Graphs :: These graphs are similar to geometric graphs
        in that nodes are placed in space with two nodes connected if
        they are close enough. These graphs ,  however ,  are not random.
        The nodes represent a set of United States cities and the
        distance between them is given by by road mileage from 1947.
        These graphs are also due to Kuth.

    - Queen Graphs :: Given an n by n chessboard ,  a queen graph is
        a graph on n^2 nodes ,  each corresponding to a square of the
        board. Two nodes are connected by an edge if the corresponding
        squares are in the same row ,  column ,  or diagonal. Unlike some
        of the other graphs ,  the coloring problem on this graph has a
        natural interpretation: Given such a chessboard ,  is it possible
        to place n sets of n queens on the board so that no two queens
        of the same set are in the same row ,  column ,  or diagonal? The
        answer is yes if and only if the graph has coloring number n.
        Vasek Chvatal has a [[http://www.cs.concordia.ca/~chvatal/queengraphs.html][page]] on
        such colorings.
    
 - MYC :: (From Michael Trick (trick@cmu.edu)) 
	  Graphs based on the Mycielski transformation.
	  These graphs are difficult to solve because they are triangle free
	  (clique number 2) but the coloring number increases in problem size.
	  

 - MYC :: (From Kuzunori Mizuno (mizuno@algor.is.tsukaba.ac.jp)
	  Graphs that are almost 3-colorable, but have a hard-to-find four clique embedded.
    
 - HOS :: (From Shahadat Hossain) 
	  Graphs obtained from a matrix partitioning problem in the segmented
	  columns approach to determine sparse Jacobian matrices.

 - CAR :: (From M. Caramia (caramia@iac.rm.cnr.it) and P. Dell'Olmo (paolo.dellolmo@uniroma1.it))  
	  k-Insertion graphs and Full Insertion graphs are a generalization
	  of myciel graphs with inserted nodes to increase graph size but not density.
	  

 - KOS :: (From Arie Koster koster@zib.de)
	  From real-life optical network design problems. Each
	  vertex corresponds to a lightpath in the network; edges correspond
	  to intersecting paths. (Corrected June 28 ,  2002 and replaced by
	  wap?a.col instances: nodes now numbered from 1 to n)

 - GOM :: (From Carla Gomes gomes@cs.cornell.edu) Latin squares (standard encoding).

 - GOM1 :: Encodings of latin square problem.

 - GEO :: Geometric graphs generated by Michael Trick. 
	  Points are generated in a 10,000 by 10,000 grid
	  and are connected by an edge if they are close enough together.
	  Edge weights are inversely proportional to the distance between
	  nodes; Node weights are uniformly generated. (Note,  I do not know
	  how hard this problem is, so if the 120 is too easy, let me know so
	  I can generate larger instances). The GEOMn instances are sparse;
	  GEOMa and GEOMb instances are denser; GEOMb requires fewer colors
	  per node.

- MUC :: Other instances are for multicoloring: the "g.col" are the
	 corresponding coloring instances with node weights uniformly
	 generated between 1 and 5; the "gb.col" have node weights uniformly
	 generated between 1 and 20.

-----

[[./index.html][Back to benchmark instances page]]


[fn:1] *duplicated*: edges counted twice (e.g., e v1 v2 , e v2 v1)
[fn:2] *self-loop*: e v1 v1
