graphcoloring.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Categories</h2>
<div class="outline-text-2" id="text-5">
<dl class="org-dl">
<dt> DSJ </dt><dd>(From David Johnson, dsj@research.att.com) Random graphs used in his paper with Aragon,  McGeoch,  and Schevon, "Optimization by Simulated Annealing: An Experimental Evaluation; Part II, Graph  Coloring and Number Partitioning",  Operations Research,  31,  378&#x2013;406 (1991).

<p>
DSJC are standard (n , p) random graphs. DSJR are geometric graphs with DSJR..c being complements of geometric graphs. In some papers the edge count is twice that given here since both (i , j) and (j , i) are counted.
</p>
</dd>

<dt> CUL </dt><dd>(From Joe Culberson (joe@cs.ualberta.ca)) Quasi-random coloring problem.
</dd>

<dt> REG </dt><dd>(From Gary Lewandowski (gary@cs.wisc.edu)) Problem based on register allocation for variables in real codes.
</dd>
<dt> LEI </dt><dd>(From Craig Morgenstern (morgenst@riogrande.cs.tcu.edu)) Leighton graphs with guaranteed coloring size. A reference is F.T. Leighton,  Journal of Research of the National Bureau of Standards, 84: 489&#x2013;505 (1979).
</dd>

<dt> SCH </dt><dd>(From Gary Lewandowski (lewandow@cs.wisc.edu)): Class scheduling graphs with and without study halls.
</dd>

<dt> LAT </dt><dd>(From Gary Lewandowski (lewandow@cs.wisc.edu)): Latin square problem.
</dd>

<dt> SGB </dt><dd>(From Michael Trick (trick@cmu.edu) Graphs from Donald Knuth's Stanford GraphBase. These can be divided into:
<dl class="org-dl">
<dt> Book Graphs </dt><dd>Given a work of literature,  a graph is created where each node represents a character. Two nodes are connected by an edge if the corresponding characters encounter each other in the book. Knuth creates the graphs for five classic works: Tolstoy's Anna Karenina (<code>anna</code>), Dicken's David Copperfield (<code>david</code>), Homer's Iliad (<code>homer</code>), Twain's Huckleberry Finn (<code>huck</code>), and Hugo's Les Miserables (<code>jean</code>).
</dd>

<dt> Game Graphs </dt><dd>A graph representing the games played in a
college football season can be represented by a graph where the
nodes represent each college team. Two teams are connected by
an edge if they played each other during the season. Knuth
gives the graph for the 1990 college football season.
</dd>

<dt> Miles Graphs </dt><dd>These graphs are similar to geometric graphs
in that nodes are placed in space with two nodes connected if
they are close enough. These graphs ,  however ,  are not random.
The nodes represent a set of United States cities and the
distance between them is given by by road mileage from 1947.
These graphs are also due to Kuth.
</dd>

<dt> Queen Graphs </dt><dd>Given an n by n chessboard ,  a queen graph is
a graph on n^2 nodes ,  each corresponding to a square of the
board. Two nodes are connected by an edge if the corresponding
squares are in the same row ,  column ,  or diagonal. Unlike some
of the other graphs ,  the coloring problem on this graph has a
natural interpretation: Given such a chessboard ,  is it possible
to place n sets of n queens on the board so that no two queens
of the same set are in the same row ,  column ,  or diagonal? The
answer is yes if and only if the graph has coloring number n.
Vasek Chvatal has a <a href="http://www.cs.concordia.ca/~chvatal/queengraphs.html">page</a> on
such colorings.
</dd>
</dl>
</dd>

<dt> MYC </dt><dd>(From Michael Trick (trick@cmu.edu)) 
Graphs based on the Mycielski transformation.
These graphs are difficult to solve because they are triangle free
(clique number 2) but the coloring number increases in problem size.
</dd>
</dl>


<dl class="org-dl">
<dt> MYC </dt><dd>(From Kuzunori Mizuno (mizuno@algor.is.tsukaba.ac.jp)
Graphs that are almost 3-colorable, but have a hard-to-find four clique embedded.
</dd>

<dt> HOS </dt><dd>(From Shahadat Hossain) 
Graphs obtained from a matrix partitioning problem in the segmented
columns approach to determine sparse Jacobian matrices.
</dd>

<dt> CAR </dt><dd>(From M. Caramia (caramia@iac.rm.cnr.it) and P. Dell'Olmo (paolo.dellolmo@uniroma1.it))  
k-Insertion graphs and Full Insertion graphs are a generalization
of myciel graphs with inserted nodes to increase graph size but not density.
</dd>
</dl>


<dl class="org-dl">
<dt> KOS </dt><dd>(From Arie Koster koster@zib.de)
From real-life optical network design problems. Each
vertex corresponds to a lightpath in the network; edges correspond
to intersecting paths. (Corrected June 28 ,  2002 and replaced by
wap?a.col instances: nodes now numbered from 1 to n)
</dd>

<dt> GOM </dt><dd>(From Carla Gomes gomes@cs.cornell.edu) Latin squares (standard encoding).
</dd>

<dt> GOM1 </dt><dd>Encodings of latin square problem.
</dd>

<dt> GEO </dt><dd>Geometric graphs generated by Michael Trick. 
Points are generated in a 10,000 by 10,000 grid
and are connected by an edge if they are close enough together.
Edge weights are inversely proportional to the distance between
nodes; Node weights are uniformly generated. (Note,  I do not know
how hard this problem is, so if the 120 is too easy, let me know so
I can generate larger instances). The GEOMn instances are sparse;
GEOMa and GEOMb instances are denser; GEOMb requires fewer colors
per node.
</dd>

<dt> MUC </dt><dd>Other instances are for multicoloring: the "g.col" are the
corresponding coloring instances with node weights uniformly
generated between 1 and 5; the "gb.col" have node weights uniformly
generated between 1 and 20.
</dd>
</dl>

<hr  />

<p>
<a href="./index.html">Back to benchmark instances page</a>
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<b>duplicated</b>: edges counted twice (e.g., e v1 v2 , e v2 v1)
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
<b>self-loop</b>: e v1 v1
</p></div>


</div>
</div></div>
</body>
</html>
